
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 2 to change, 1 to destroy.</code></pre>

* Create
  * module.citizen-ui-draft-store.azurerm_redis_cache.redis
* Update
  * azurerm_key_vault_secret.redis_draft_store_access_key
  * module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds
* Replace
  * module.citizen-ui-draft-store.azurerm_private_endpoint.this[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.redis_draft_store_access_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "redis_draft_store_access_key" {
        id                      = "https://civil-cui-aat.vault.azure.net/secrets/draft-store-access-key/fc0e06f3957e47b58e3fd8953a4c3bd5"
        name                    = "draft-store-access-key"
      ~ tags                    = {
          - "application"         = "civil"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/civil-citizen-ui.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#civil_contact"
          - "environment"         = "staging"
          - "managedBy"           = "Civil"
          - "source"              = "redis civil-citizen-ui-draft-store-aat.redis.cache.windows.net"
        } -> (known after apply)
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # module.citizen-ui-draft-store.azurerm_private_endpoint.this[0] must be replaced
-/+ resource "azurerm_private_endpoint" "this" {
      ~ custom_dns_configs       = [] -> (known after apply)
      ~ id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-draft-store-cache-aat/providers/Microsoft.Network/privateEndpoints/civil-citizen-ui-draft-store-aat" -> (known after apply)
        name                     = "civil-citizen-ui-draft-store-aat"
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-draft-store-cache-aat/providers/Microsoft.Network/networkInterfaces/civil-citizen-ui-draft-store-aat.nic.680003a2-eb3d-4388-b7a4-7a44900d11bc"
              - name = "civil-citizen-ui-draft-store-aat.nic.680003a2-eb3d-4388-b7a4-7a44900d11bc"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-draft-store-cache-aat/providers/Microsoft.Network/privateEndpoints/civil-citizen-ui-draft-store-aat/privateDnsZoneGroups/redis-endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.redis.cache.windows.net"
              - name                = "privatelink.redis.cache.windows.net"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net"
              - record_sets         = []
            },
        ] -> (known after apply)
        tags                     = {
            "application"         = "civil"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/civil-citizen-ui.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#civil_contact"
            "environment"         = "staging"
            "managedBy"           = "Civil"
        }
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-draft-store-cache-aat/providers/Microsoft.Network/privateEndpoints/civil-citizen-ui-draft-store-aat/privateDnsZoneGroups/redis-endpoint-dnszonegroup" -> (known after apply)
            name                 = "redis-endpoint-dnszonegroup"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                           = "civil-citizen-ui-draft-store-aat"
          ~ private_connection_resource_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-draft-store-cache-aat/providers/Microsoft.Cache/redis/civil-citizen-ui-draft-store-aat" -> (known after apply) # forces replacement
          ~ private_ip_address             = "10.96.136.15" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.citizen-ui-draft-store.azurerm_redis_cache.redis will be created
  + resource "azurerm_redis_cache" "redis" {
      + capacity                      = 1
      + enable_non_ssl_port           = false
      + family                        = "P"
      + hostname                      = (known after apply)
      + id                            = (known after apply)
      + location                      = "uksouth"
      + minimum_tls_version           = "1.2"
      + name                          = "civil-citizen-ui-draft-store-aat"
      + port                          = (known after apply)
      + primary_access_key            = (sensitive value)
      + primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      + public_network_access_enabled = false
      + redis_version                 = "6"
      + replicas_per_master           = (known after apply)
      + replicas_per_primary          = (known after apply)
      + resource_group_name           = "civil-citizen-ui-draft-store-cache-aat"
      + secondary_access_key          = (sensitive value)
      + secondary_connection_string   = (sensitive value)
      + sku_name                      = "Premium"
      + ssl_port                      = (known after apply)
      + tags                          = {
          + "application"         = "civil"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/civil-citizen-ui.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#civil_contact"
          + "environment"         = "staging"
          + "managedBy"           = "Civil"
        }

      + redis_configuration {
          + enable_authentication           = true
          + maxclients                      = (known after apply)
          + maxfragmentationmemory_reserved = 642
          + maxmemory_delta                 = 642
          + maxmemory_policy                = "volatile-lru"
          + maxmemory_reserved              = 642
        }
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-aat/providers/Microsoft.KeyVault/vaults/civil-cui-aat|civil-cui-aat"
        name                           = "civil-cui-aat"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 2 to add, 2 to change, 1 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.citizen-ui-draft-store.azurerm_redis_cache.redis has been deleted
  - resource "azurerm_redis_cache" "redis" {
      - hostname                      = "civil-citizen-ui-draft-store-aat.redis.cache.windows.net" -> null
      - id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-draft-store-cache-aat/providers/Microsoft.Cache/redis/civil-citizen-ui-draft-store-aat" -> null
        name                          = "civil-citizen-ui-draft-store-aat"
      - primary_access_key            = (sensitive value)
      - ssl_port                      = 6380 -> null
        tags                          = {
            "application"         = "civil"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/civil-citizen-ui.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#civil_contact"
            "environment"         = "staging"
            "managedBy"           = "Civil"
        }
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":2313,"Program":"tfcmt","SHA1":"","Vars":{}} -->